belbns/ll_pump_ctrl/ll_pump_ctrl.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
SH.GPXTI1.0=GPIO_EXTI1
ProjectManager.MainLocation=Core/Src
RCC.USART1Freq_Value=48000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F030F4Px
Dma.ADC.0.Mode=DMA_NORMAL
Dma.USART1_TX.1.MemInc=DMA_MINC_ENABLE
USART1.BaudRate=38400
RCC.PLLCLKFreq_Value=48000000
PA0.GPIO_Label=PWM_IN
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-LL-true,2-MX_DMA_Init-DMA-false-LL-true,3-SystemClock_Config-RCC-false-LL-false,4-MX_ADC_Init-ADC-false-LL-true,5-MX_TIM16_Init-TIM16-false-LL-true,6-MX_USART1_UART_Init-USART1-false-LL-true,7-MX_RTC_Init-RTC-false-LL-true
Dma.ADC.0.Priority=DMA_PRIORITY_LOW
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
PA3.GPIOParameters=GPIO_Label
PA6.GPIO_Label=BUTTON
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.IPParameters=VirtualMode-Asynchronous,BaudRate
PA5.PinState=GPIO_PIN_SET
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
Mcu.IP4=RTC
RCC.FCLKCortexFreq_Value=48000000
Mcu.IP5=SYS
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP0=ADC
Mcu.IP1=DMA
RTC.SynchPrediv=399
Mcu.UserConstants=
VP_ADC_Vref_Input.Signal=ADC_Vref_Input
Mcu.ThirdPartyNb=0
Dma.ADC.0.PeriphInc=DMA_PINC_DISABLE
RCC.HCLKFreq_Value=48000000
Mcu.IPNb=8
ProjectManager.PreviousToolchain=
PB1.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_RISING_FALLING
RTC.IPParameters=AsynchPrediv,SynchPrediv,Year,Month,Date,Hours
Mcu.Pin6=PA6
Mcu.Pin7=PA7
Mcu.Pin8=PB1
Mcu.Pin9=PA9
RCC.AHBFreq_Value=48000000
Mcu.Pin0=PA0
Mcu.Pin1=PA1
Dma.ADC.0.Direction=DMA_PERIPH_TO_MEMORY
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA2
Mcu.Pin3=PA3
Mcu.Pin4=PA4
ADC.SamplingTime=ADC_SAMPLETIME_71CYCLES_5
Mcu.Pin5=PA5
ProjectManager.ProjectBuild=false
PA0.Locked=true
PA4.Locked=true
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLMUL=RCC_PLL_MUL12
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.2
MxDb.Version=DB.6.0.10
PA6.GPIO_PuPd=GPIO_PULLUP
RTC.Month=RTC_MONTH_DECEMBER
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=true
PA14.Mode=Serial_Wire
PB1.GPIO_Label=STAT
File.Version=6
RTC.AsynchPrediv=99
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.RequestsNb=2
ProjectManager.HalAssertFull=false
Dma.USART1_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
ProjectManager.ProjectName=ll_pump_ctrl
PA0.Signal=GPXTI0
Dma.ADC.0.MemInc=DMA_MINC_ENABLE
Mcu.Package=TSSOP20
PB1.Signal=GPXTI1
PA6.Signal=GPIO_Input
PA5.Locked=true
PA7.Locked=true
PA14.Locked=true
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=POWER
Dma.ADC.0.Instance=DMA1_Channel1
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
SH.GPXTI0.0=GPIO_EXTI0
PA10.Signal=USART1_RX
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
PA5.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP
Dma.ADC.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
TIM16.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
Dma.Request1=USART1_TX
RCC.APB1TimFreq_Value=48000000
Dma.USART1_TX.1.Priority=DMA_PRIORITY_LOW
TIM16.Prescaler=47
NVIC.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Dma.Request0=ADC
PA4.GPIO_Label=PUMP
ProjectManager.CustomerFirmwarePackage=
PA3.Signal=GPIO_Output
Dma.USART1_TX.1.Direction=DMA_MEMORY_TO_PERIPH
PA2.Locked=true
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
PA6.GPIOParameters=GPIO_PuPd,GPIO_Label
Dma.USART1_TX.1.Instance=DMA1_Channel2
ProjectManager.ProjectFileName=ll_pump_ctrl.ioc
PA7.Mode=IN7
Mcu.PinsNb=18
PA10.Mode=Asynchronous
ProjectManager.NoMain=false
Dma.USART1_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
VP_ADC_Vref_Input.Mode=IN-Vrefint
SH.GPXTI0.ConfNb=1
ProjectManager.DefaultFWLocation=true
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
ADC.IPParameters=SamplingTime
ProjectManager.DeletePrevious=true
RCC.FamilyName=M
Dma.ADC.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_SWDIO
PA9.Mode=Asynchronous
ProjectManager.TargetToolchain=Makefile
RTC.Year=20
PA9.Signal=USART1_TX
ProjectManager.RegisterCallBack=
PA1.Signal=GPIO_Output
PB1.Locked=true
PA5.Signal=GPIO_Output
Dma.USART1_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
board=custom
ProjectManager.LastFirmware=true
Dma.ADC.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
MxCube.Version=6.1.0
PA5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PA1.GPIO_Label=PWRC
VP_SYS_VS_Systick.Mode=SysTick
PA9.Locked=true
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,PLLCLKFreq_Value,PLLMUL,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F030F4Px
PA2.Signal=GPIO_Output
ProjectManager.UnderRoot=false
Mcu.IP6=TIM16
Mcu.IP7=USART1
ProjectManager.CoupleFile=false
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=48000000
RTC.Hours=12
RCC.TimSysFreq_Value=48000000
PA1.Locked=true
PA7.GPIO_Label=PRESSURE
PA3.Locked=true
PA5.GPIO_Label=DS18C20
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
Dma.USART1_TX.1.Mode=DMA_NORMAL
PA13.Locked=true
ProjectManager.CompilerOptimize=6
PA14.Signal=SYS_SWCLK
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=VP_RTC_VS_RTC_Calendar
Dma.USART1_TX.1.PeriphInc=DMA_PINC_DISABLE
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_SYS_VS_Systick
Mcu.Pin13=VP_ADC_Vref_Input
Mcu.Pin14=VP_RTC_VS_RTC_Activate
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_TIM16_VS_ClockSourceINT
PA5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
Mcu.Pin11=PA13
Mcu.Pin12=PA14
Mcu.Pin10=PA10
NVIC.DMA1_Channel2_3_IRQn=true\:0\:0\:false\:false\:true\:false\:true
TIM16.IPParameters=Prescaler,AutoReloadPreload
NVIC.DMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true
SH.GPXTI1.ConfNb=1
RCC.APB1Freq_Value=48000000
RTC.Date=10
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32F030F4Px
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=LED
PB1.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
PA7.Signal=ADC_IN7
NVIC.EXTI0_1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA6.Locked=true
